export const CURRENCY = 'BYN';
export const COMPANY_NAME = 'Astrum';
export const COMPANY_MAIL = 'astrumby@tut.by';
export const COMPANY_ADRESS = 'г. Гомель, ул. Рабочая 26 (1 этаж)';
export const COMPANY_TEL = '+375(44)565-59-84';
export const COMPANY_TIME = 'с 10-00 до 19-00';

export const TOASTOBJECTS = {
  pauseOnFocusLoss: false,
  draggable: false,
  pauseOnHover: false,
  autoClose: 2000,
};
//import {TEXT} from "../../data/Constants"
//{TEXT.products}
// import 'moment/locale/ru';
// moment.locale('ru');
export const ABOUT = `Наша компания занимается реализацией и производством мебели с 2007 года.
В нашем магазине вы найдете как готовые решения по корпусной и мягкой мебели от ведущих мебельных фабрик, так и существует возможность проектирования и изготовления корпусной мебели по индивидуальным проектам.  Мебель, которая  изготавливается по индивидуальному проекту, производится с учетом всех Ваших пожеланий. Возможности дизайна мебели на заказ не ограничены. Мы предлагаем Вам широчайший выбор всевозможных комплектующих, используемых при изготовлении мебели на заказ — панелей из ламинированной ДСП, МДФ, зеркал, интерьерная фотопечать, пескоструйные рисунки и т.д. \n\n
​​Мы сотрудничаем с лучшими белорусскими фабриками по производству мебели и мебельных комплектующих. Квалифицированные специалисты нашей компании имеют значительный опыт работы. Благодаря этому, каждое изделие, созданное нами и нашими партнерами, обретает свой неповторимый дизайн и безупречное качество.
Будем рады видеть Вас в качестве наших клиентов!`;
export const TEXT = {
  pages: {
    about: 'О компании',
  },
  mainpage: {
    advertising: {
      title: 'УЗНАВАЙТЕ О НОВИНКАХ И АКЦИЯХ',
      subtitle: 'подпишитесь на нашу рассылку',
    },
  },
  user: {
    name: 'Имя',
    email: 'Почта',
    psw: 'Пароль',
    new_psw: 'Новый пароль',
    confirm_psw: 'Подтвердите пароль',
  },
  hi: 'Привет',
  main: 'Главная',
  users: 'Пользователи',
  products: 'Товары',
  orders: 'Заказы',
  order_info: 'Информация заказа',
  detail: 'Подробнее',
  login: 'Войти',
  logout: 'Выйти',
  loading: 'Загрузка',
  settings: 'Настройки профиля',
  register_title: 'Зарегистрировался',
  tips: {
    add: 'Товар добавлен',
    update: 'Товар обновлен',
    delete: 'Вы уверены?',
  },
  forms: {
    add_title: 'Добавление товара',
    update_title: 'Обновление товара',
    update_profile: 'Обновить профиль',
  },
  placeholder: 'Введите...',
  placeholder_choose: 'Выберите...',
  search: 'Поиск',
  product: {
    title: 'Заголовок товара',
    stock: 'Наличие',
    desc: 'Описание',
    img: 'Картинка',
    price: 'Цена',
    reviews: 'Отзывы',
    count: 'Кол-во',
  },
  reviews: {
    title: 'ОТЗЫВЫ',
    no_reviews: 'Нет отзывов',
    writeReview: 'НАПИШИТЕ ОТЗЫВ',
    rating: 'Оценка',
    1: 'Плохо',
    2: 'Нормально',
    3: 'Хорошо',
    4: 'Очень хорошо',
    5: 'Отлично',
    comment: 'Комментарий',
    please: 'Пожалуйста',
    msg: 'чтобы написать отзыв',
    register: 'Зарегистрируйтесь',
  },
  roles: {
    admin: 'Администратор',
    customer: 'Покупатель',
  },
  errors: {
    notfound: 'Страница не найдена',
    psw_not_match: 'Пароли не совпадают',
    update_profile: 'Профиль обновлен',
  },
  btns: {
    create: 'Создать',
    add: 'Добавить',
    update: 'Изменить',
    send: 'Отправить',
    register: 'Зарегистрироваться',
    login: 'Войти',
    logout: 'Выйти',
    profile: 'Профиль',
    create_account: ' У меня есть аккаунт',
    account: ' У меня есть аккаунт',
    continue: 'Продолжить',
    order: 'Заказать',
    link_to_main: 'перейти на главную страницу',
    link_to_buy: 'перейти к покупкам',
    link_to_shop: 'перейти в магазин',
    continue_shopping: 'Продолжить покупки',
    subscribe: 'Подписаться',
    pay: 'Оплатить',
  },
  pay: {
    title: 'Выберите метод оплаты',
    // 1: 'PayPal or Credit Card',
    1: 'Credit Card',
  },
  order: {
    no_orders: 'Нет заказов',
    new: 'Новые заказы',
    title: 'Адрес доставки',
    id: 'Id заказа',
    status: 'Статус',
    date_create_pay: 'Дата создания/оплаты',
    summa: 'Сумма',
    shipping: 'Доставка',
    address: 'Адрес',
    country: 'Страна',
    city: 'Город',
    postCode: 'Индекс',
    pay: 'Оплата',
    date_create: 'Дата создания',
    mark_deliv: 'ПОМЕТИТЬ КАК ДОСТАВЛЕННОЕ',
    // delivery_time: 'Доставлено в',
    pay_time: 'Оплачено в',
    deliv: 'Доставлено',
    not_deliv: 'Не доставлено',
    paid: 'Оплачено',
    not_paid: 'Не оплачено',
    subtotal: 'Промежуточная сумма',
    shipping_cost: 'Стоимость доставки',
    grand_total: 'Общая сумма',
    product: 'Товар',
    qty: 'Кол-во',
    price: 'Цена за ед.',
    total: 'Всего',
    result: 'Итого',
    msg: 'Твой заказ пустой',
  },
  cart: {
    title: 'Корзина пустая',
    total: 'Всего товаров',
  },
  yes: 'Есть',
  no: 'Нет',
};
